{
  "narratives": [
    {
      "stop": 1,
      "title": "Inbound",
      "narrative": "6:40 AM. The platform is cold and quiet as you wait for the train—the same one you've taken every weekday for years. You pull your beige trenchcoat tighter, scanning the empty platform. A distant rumble signals the approaching train, just like yesterday and countless days before.",
      "choices": [
        {
          "text": "Think about the life you once dreamed of",
          "decisionType": "soul",
          "title": "Inner Reflection",
          "swingMeterType": "standard",
          "meterContext": "As the train approaches, your mind begins to drift to forgotten dreams...",
          "resultGood": "Old dreams resurface—art you created, places unseen. Something long dormant stirs within you.",
          "resultOkay": "The details are fuzzy, but you find comfort in remembering dreams beyond this daily commute.",
          "resultFail": "Those childish dreams feel distant now. Reality has worn them down. Better focus on today.",
          "effects": {
            "soul": 1,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "Observe the world around you",
          "decisionType": "connections",
          "title": "Social Awareness",
          "swingMeterType": "standard",
          "meterContext": "You look around at the other commuters gathering on the platform...",
          "resultGood": "You notice overlooked details—an elderly woman's kind eyes, a nervous young man. Everyone has a story. Including you.",
          "resultOkay": "Faces seem less anonymous today. You share a knowing nod with another commuter about the morning routine.",
          "resultFail": "Everyone looks tired. More drones heading to their hives. Nothing worth noting.",
          "effects": {
            "soul": 0,
            "connections": 1,
            "money": 0
          }
        },
        {
          "text": "Review your upcoming work presentation",
          "decisionType": "success",
          "title": "Career Focus",
          "swingMeterType": "standard",
          "meterContext": "You mentally rehearse the key points of today's presentation...",
          "resultGood": "The structure crystallizes in your mind. You've got this. Your preparation might finally get you noticed.",
          "resultOkay": "You review the main points, though details remain fuzzy. It should be adequate, as always.",
          "resultFail": "Your thoughts scatter as anxiety creeps in. Another day of barely staying afloat.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 2,
      "title": "Drone",
      "narrative": "The train lurches forward as you settle in your usual seat. Through the window, suburbs blur in sameness. Halfway through your commute, your phone buzzes—your boss: 'I need that report by noon.' You'd planned lunch with an old friend you've been meaning to reconnect with for months.",
      "choices": [
        {
          "text": "Prioritize the report",
          "decisionType": "success",
          "title": "Work First",
          "swingMeterType": "standard",
          "meterContext": "You consider how to handle the urgent work request...",
          "resultGood": "You text to reschedule and organize your morning to complete the report. Your boss will notice your reliability.",
          "resultOkay": "With a sigh, you cancel lunch. The report will get done, though not your best work. But enough.",
          "resultFail": "You stare at your phone, trapped. Another personal sacrifice for a job that takes and takes.",
          "effects": {
            "soul": -1,
            "connections": -1,
            "money": 2
          }
        },
        {
          "text": "Try to do both",
          "decisionType": "connections",
          "title": "Balance",
          "swingMeterType": "quick",
          "meterContext": "You think about how to manage both commitments...",
          "resultGood": "You arrange a shorter lunch near your office, working intensely before and after. A thoughtful compromise.",
          "resultOkay": "You suggest a quick coffee instead. Not ideal, but at least you're maintaining the connection.",
          "resultFail": "You attempt to plan for both, but it's impossible. Someone will be disappointed—probably yourself.",
          "effects": {
            "soul": 0,
            "connections": 1,
            "money": 0
          }
        }
      ]
    },
    {
      "stop": 3,
      "title": "Write Along The Way",
      "narrative": "Your college journal sits on your nightstand gathering dust. Inside are fragments of stories you wanted to write, dreams you planned to chase. Tonight, flipping through its pages, you feel a strange spark that hasn't flickered in years. The blank page calls to you.",
      "choices": [
        {
          "text": "Start writing again, even if just for yourself",
          "decisionType": "soul",
          "title": "Self-Expression",
          "swingMeterType": "standard",
          "meterContext": "The blank page before you invites expression...",
          "resultGood": "Words flow easily. You write about your day, thoughts, forgotten dreams—reconnecting with yourself.",
          "resultOkay": "You manage a few paragraphs. Not Shakespeare, but it feels good to express yourself again.",
          "resultFail": "You stare at the blank page, pen hovering. The words don't come. That part of you might be gone.",
          "effects": {
            "soul": 2,
            "connections": 0,
            "money": 0
          },
          "unlockPassive": "write_along"
        },
        {
          "text": "Write a letter to reconnect with an old friend",
          "decisionType": "connections",
          "title": "Reach Out",
          "swingMeterType": "standard",
          "meterContext": "As you think of someone you've lost touch with...",
          "resultGood": "The letter bridges time. You recall shared moments, expressing genuine hope for reconnection.",
          "resultOkay": "You write a friendly note, keeping it light but sincere. A small step toward rebuilding.",
          "resultFail": "You start several times but can't find the right words. What could you say after all this time?",
          "effects": {
            "soul": 0,
            "connections": 2,
            "money": 0
          }
        },
        {
          "text": "Draft ideas for your work presentation instead",
          "decisionType": "success",
          "title": "Get Ahead",
          "swingMeterType": "standard",
          "meterContext": "As your thoughts turn to work...",
          "resultGood": "You outline a brilliant presentation that could impress your boss and finally earn recognition.",
          "resultOkay": "You jot down some decent ideas. Not inspired, but practical enough to be useful.",
          "resultFail": "You try focusing on work, but your heart isn't in it. Every idea feels forced and hollow.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 4,
      "title": "Last Life",
      "narrative": "It's 2AM. Your monitor's blue light is the only illumination. 'Just one more level,' you told yourself three hours ago. Friends have invited you out countless times, but the digital world feels safer, more controllable. Your character stands victorious, but the victory feels hollow.",
      "choices": [
        {
          "text": "Log off and text your friends about weekend plans",
          "decisionType": "connections",
          "title": "Reconnect",
          "swingMeterType": "noOvershot",
          "meterContext": "The hollow victory on screen fades as your thoughts turn to real connections...",
          "resultGood": "You reach out and feel genuine connection. Friends respond with excitement about meeting up soon.",
          "resultOkay": "A few texts get exchanged. Not a deep connection, but it's a small step forward.",
          "resultFail": "Your attempt feels awkward and forced. The digital divide seems wider than ever.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": -1
          }
        },
        {
          "text": "Go to bed, you'll text friends tomorrow maybe",
          "decisionType": "soul",
          "title": "Self-Care",
          "swingMeterType": "noOvershot",
          "meterContext": "As the victory screen fades, you consider your options...",
          "resultGood": "You recognize your need for rest. A moment of clarity breaks through the digital fog.",
          "resultOkay": "You drift off to sleep, thoughts of connection barely registering in your mind.",
          "resultFail": "Sleep eludes you as the screen's blue light continues burning in your thoughts.",
          "effects": {
            "soul": 0,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "Start a new game, you're on a roll tonight",
          "decisionType": "success",
          "title": "Achievement",
          "swingMeterType": "noOvershot",
          "meterContext": "As the victory screen fades, the pull of another game beckons...",
          "resultGood": "Another hollow victory, another meaningless achievement that momentarily fills the emptiness.",
          "resultOkay": "Hours blend into an indistinguishable haze, time passing without meaning or memory.",
          "resultFail": "The pattern becomes clear—you're trapped in a cycle of empty victories and wasted nights.",
          "effects": {
            "soul": -1,
            "connections": -1,
            "money": 0
          },
          "unlockPassive": "last_life"
        }
      ]
    },
    {
      "stop": 5,
      "title": "Strange Passenger",
      "narrative": "A stranger sits beside you today—something that never happens in your regulated routine. They're reading a book you loved years ago. Your eyes meet with an unexpected pull, a strange connection. They smile, and for a moment, the train seems less gray.",
      "choices": [
        {
          "text": "Strike up a conversation about the book",
          "decisionType": "connections",
          "title": "Open Up",
          "swingMeterType": "critical",
          "meterContext": "The book in their hands sparks a memory, and you consider reaching out...",
          "resultGood": "A conversation unfolds that reawakens forgotten parts of yourself through shared passion.",
          "resultOkay": "A pleasant exchange ensues—comfortable, if ultimately superficial and brief.",
          "resultFail": "Your attempted conversation falls flat, leaving you feeling more isolated than before.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": 0
          }
        },
        {
          "text": "Smile politely and return to your thoughts",
          "decisionType": "soul",
          "title": "Gentle Acknowledgment",
          "swingMeterType": "critical",
          "meterContext": "You notice their book, and consider how to respond...",
          "resultGood": "In quiet acknowledgment, their presence triggers unexpectedly profound inner reflection.",
          "resultOkay": "A fleeting moment of connection before you retreat to your familiar inner landscape.",
          "resultFail": "The moment passes without leaving any impression, another forgettable commute.",
          "effects": {
            "soul": 1,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "Look away, relationships are too complicated",
          "decisionType": "success",
          "title": "Stay Focused",
          "swingMeterType": "critical",
          "meterContext": "As your eyes meet, you weigh the unpredictability of human connection...",
          "resultGood": "You maintain your emotional walls, preserving the careful boundaries you've constructed.",
          "resultOkay": "Another potential connection drifts away unnoticed as you focus on certainty.",
          "resultFail": "The familiar isolation feels increasingly suffocating, though you'd never admit it.",
          "effects": {
            "soul": -2,
            "connections": -1,
            "money": 0
          },
          "unlockPassive": "strange_passenger"
        }
      ]
    },
    {
      "stop": 6,
      "title": "For Me",
      "narrative": "Your neighbor bought a new car—sleek, expensive, turning heads. Your reliable vehicle suddenly seems inadequate. The downtown showroom is having a sale. You don't need a new car, but the thought of arriving at work in something impressive takes root in your mind.",
      "choices": [
        {
          "text": "Your current car is fine, save your money",
          "decisionType": "soul",
          "title": "Inner Satisfaction",
          "swingMeterType": "standard",
          "meterContext": "As you weigh the value of material possessions...",
          "resultGood": "You realize with clarity that material possessions don't define your worth or happiness.",
          "resultOkay": "You convince yourself to keep your current car, though status envy lingers faintly.",
          "resultFail": "The temptation of status and appearance weighs on you, harder to dismiss than expected.",
          "effects": {
            "soul": 1,
            "connections": 0,
            "money": 1
          }
        },
        {
          "text": "Look at used cars that balance practicality and image",
          "decisionType": "connections",
          "title": "Social Impression",
          "swingMeterType": "standard",
          "meterContext": "As you try to find a middle ground...",
          "resultGood": "You find a balanced option that satisfies practicality while allowing some self-expression.",
          "resultOkay": "Your compromise satisfies neither need completely, but seems reasonable enough.",
          "resultFail": "The search only confuses you more, leaving you unsatisfied with every option.",
          "effects": {
            "soul": 0,
            "connections": 1,
            "money": -2
          }
        },
        {
          "text": "Visit the dealership, get what you deserve",
          "decisionType": "success",
          "title": "Status Symbol",
          "swingMeterType": "standard",
          "meterContext": "As the allure of status and recognition pulls at you...",
          "resultGood": "A brief thrill of acquisition masks deeper insecurities as you sign the financing papers.",
          "resultOkay": "The purchase feels hollow but temporarily exciting. At least it's something new.",
          "resultFail": "You commit to a financial burden that brings no satisfaction, just mounting pressure.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": -4
          }
        }
      ]
    },
    {
      "stop": 7,
      "title": "Bioavailable",
      "narrative": "Your doctor mentions your blood pressure at your checkup. 'Stress,' he says. 'Find ways to relax.' But constant emails, deadlines, mortgage payments create an addictive pressure cycle. The adrenaline rush of solving one crisis after another has become your normal.",
      "choices": [
        {
          "text": "Take prescribed medication, make lifestyle changes",
          "decisionType": "soul",
          "title": "Self-Healing",
          "swingMeterType": "noOvershot",
          "meterContext": "The doctor's warning lingers in your mind...",
          "resultGood": "Small but meaningful health changes take root. Perhaps these could become lasting habits.",
          "resultOkay": "You take some steps toward better health, but your motivation wavers under daily pressures.",
          "resultFail": "The changes feel forced and unsustainable. Another prescription joins others in your cabinet.",
          "effects": {
            "soul": 2,
            "connections": 0,
            "money": -1
          }
        },
        {
          "text": "Make minor adjustments to your routine",
          "decisionType": "connections",
          "title": "Ask for Support",
          "swingMeterType": "noOvershot",
          "meterContext": "Leaving the doctor's office, you consider how to approach this health warning...",
          "resultGood": "You reach out to friends and family, creating a support network for healthier habits.",
          "resultOkay": "You make tentative efforts to address stress levels, with mixed success.",
          "resultFail": "Your half-hearted changes feel superficial and ineffective as pressures continue mounting.",
          "effects": {
            "soul": 1,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "You thrive under pressure, it's fine",
          "decisionType": "success",
          "title": "Power Through",
          "swingMeterType": "noOvershot",
          "meterContext": "Leaving the doctor's office, you assess your relationship with stress...",
          "resultGood": "You feel momentarily confident in your ability to handle the pressure and keep performing.",
          "resultOkay": "You convince yourself everything's under control, pushing the warning aside.",
          "resultFail": "The cracks begin to show as your body sends increasingly urgent warning signals.",
          "effects": {
            "soul": -2,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 8,
      "title": "Outbound",
      "narrative": "A work conference in another city. As the return train pulls away, you realize you didn't check email once today. The world didn't end. For the first time in years, you watch the scenery without your mind racing ahead to the next task. Something shifts inside you.",
      "choices": [
        {
          "text": "Enjoy the moment, stay disconnected",
          "decisionType": "soul",
          "title": "Present Awareness",
          "swingMeterType": "standard",
          "meterContext": "As you savor this moment of peace...",
          "resultGood": "A profound sense of peace washes over you. For once, you're fully present in the moment.",
          "resultOkay": "You experience momentary calm before familiar anxieties begin creeping back in.",
          "resultFail": "The silence quickly becomes uncomfortable, driving you back to familiar patterns.",
          "effects": {
            "soul": 2,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "Share your realization with a friend",
          "decisionType": "connections",
          "title": "Shared Insight",
          "swingMeterType": "standard",
          "meterContext": "As you feel compelled to share this moment of peace...",
          "resultGood": "The conversation deepens your connection and understanding, giving meaning to the insight.",
          "resultOkay": "A brief exchange hints at deeper potential, though it doesn't quite reach that depth.",
          "resultFail": "Your attempt to translate the moment falls flat, the insight lost in transmission.",
          "effects": {
            "soul": 1,
            "connections": 1,
            "money": 0
          }
        },
        {
          "text": "Check your phone, you've been irresponsible",
          "decisionType": "success",
          "title": "Duty First",
          "swingMeterType": "standard",
          "meterContext": "As your professional responsibility tugs at you...",
          "resultGood": "Catching up on communications gives you a sense of control and accomplishment.",
          "resultOkay": "The familiar routine returns, but the fleeting peace is already lost to memory.",
          "resultFail": "The flood of emails and messages overwhelms you, anxiety immediately returning.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 9,
      "title": "Life Between Life",
      "narrative": "A former colleague died suddenly. At the funeral, people speak of achievements and career milestones. No one mentions joy, passion, or love. You recognize yourself in these tributes—a life measured in promotions and acquisitions. The thought follows you home like a shadow.",
      "choices": [
        {
          "text": "Start a bucket list of experiences, not achievements",
          "decisionType": "soul",
          "title": "Life's Meaning",
          "swingMeterType": "critical",
          "meterContext": "The hollow eulogy still echoes as you consider your own legacy...",
          "resultGood": "You begin seeing life beyond professional milestones, focusing on experiences that bring joy.",
          "resultOkay": "You create a tentative list, though old thinking patterns still cloud your vision.",
          "resultFail": "The list feels like just another task, another box to check in an endless series.",
          "effects": {
            "soul": 2,
            "connections": 1,
            "money": -1
          }
        },
        {
          "text": "Reach out to old friends you've lost touch with",
          "decisionType": "connections",
          "title": "Restore Bonds",
          "swingMeterType": "critical",
          "meterContext": "As the importance of human connection comes to mind...",
          "resultGood": "Genuine reconnections bloom. You realize relationships are the true measure of a life.",
          "resultOkay": "A few awkward but well-intentioned conversations begin to bridge forgotten connections.",
          "resultFail": "Your outreach feels too late—most connections seem irreparably broken by time and neglect.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": -1
          }
        },
        {
          "text": "Double down on your career, legacy matters",
          "decisionType": "success",
          "title": "Double Down",
          "swingMeterType": "critical",
          "meterContext": "As you consider what kind of legacy you want to leave...",
          "resultGood": "A renewed sense of professional purpose takes hold as you recommit to achievement.",
          "resultOkay": "You continue on your current path, unsure if it's truly fulfilling but familiar.",
          "resultFail": "The pursuit of career success feels increasingly hollow yet you see no alternative.",
          "effects": {
            "soul": -1,
            "connections": -1,
            "money": 2
          }
        }
      ]
    },
    {
      "stop": 10,
      "title": "Squares",
      "narrative": "The pandemic transformed your dining room into an office. Your world has contracted into Zoom squares, each a tiny window into other confined lives. The boundaries between work and home have dissolved completely. You haven't left your apartment in three days.",
      "choices": [
        {
          "text": "Set strict work boundaries, reclaim your space",
          "decisionType": "soul",
          "title": "Reclaim Control",
          "swingMeterType": "noOvershot",
          "meterContext": "As another meeting invitation appears on your screen...",
          "resultGood": "With firm self-assertion, you create meaningful separation between work and personal life.",
          "resultOkay": "Small boundaries get established, though significant challenges still remain.",
          "resultFail": "Your attempts to create boundaries feel futile as work continues to invade all spaces.",
          "effects": {
            "soul": 2,
            "connections": 0,
            "money": -1
          }
        },
        {
          "text": "Organize a virtual social event with colleagues",
          "decisionType": "connections",
          "title": "Digital Connection",
          "swingMeterType": "noOvershot",
          "meterContext": "As you think about maintaining human connection...",
          "resultGood": "A meaningful virtual gathering emerges where real connections break through digital barriers.",
          "resultOkay": "Polite interactions occur, but nothing transformative emerges from the screen.",
          "resultFail": "The whole event feels awkward and forced, highlighting the limitations of virtual space.",
          "effects": {
            "soul": 0,
            "connections": 2,
            "money": 0
          }
        },
        {
          "text": "Work longer hours to show your dedication",
          "decisionType": "success",
          "title": "Career Opportunity",
          "swingMeterType": "noOvershot",
          "meterContext": "As you see an opportunity in this crisis...",
          "resultGood": "Management seems to notice your extra effort as you exceed expectations remotely.",
          "resultOkay": "You blend into the background of corporate expectations, another face in the squares.",
          "resultFail": "Burnout begins consuming you entirely as the line between work and life disappears.",
          "effects": {
            "soul": -2,
            "connections": -1,
            "money": 2
          }
        }
      ]
    },
    {
      "stop": 11,
      "title": "Star Light",
      "narrative": "3:17 AM. You stare at the ceiling, watching the star-shaped chandelier cast shadows as cars pass outside. Sleep eludes you night after night. Your mind races with everything done and everything failed. The star seems to pulse with each anxious thought.",
      "choices": [
        {
          "text": "Get up and write down your thoughts",
          "decisionType": "soul",
          "title": "Emotional Release",
          "swingMeterType": "standard",
          "meterContext": "In the quiet darkness, your racing thoughts demand expression...",
          "resultGood": "Your emotions flow onto the page, creating a path toward clarity in these small hours.",
          "resultOkay": "A few scattered thoughts find paper before momentum fades back into restlessness.",
          "resultFail": "The blank page only amplifies your inner turmoil, another witness to your sleeplessness.",
          "effects": {
            "soul": 2,
            "connections": 0,
            "money": 0
          }
        },
        {
          "text": "Text a friend who might also be awake",
          "decisionType": "connections",
          "title": "Midnight Confidant",
          "swingMeterType": "standard",
          "meterContext": "Realizing sleep won't come easily tonight, you reach for your phone...",
          "resultGood": "An honest, midnight conversation pierces through your isolation with surprising depth.",
          "resultOkay": "A brief exchange brings some comfort, though sleep remains distant.",
          "resultFail": "The unanswered message only emphasizes your solitude in these dark hours.",
          "effects": {
            "soul": 0,
            "connections": 2,
            "money": 0
          }
        },
        {
          "text": "Check work emails to distract yourself",
          "decisionType": "success",
          "title": "Productive Insomnia",
          "swingMeterType": "standard",
          "meterContext": "Realizing sleep won't come easily tonight, you think about using these wakeful hours...",
          "resultGood": "Getting ahead on work gives you a momentary sense of control amid the sleeplessness.",
          "resultOkay": "Processing a few emails fills time, though sleep remains frustratingly elusive.",
          "resultFail": "Work emails only intensify your anxiety, guaranteeing another sleepless night.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 12,
      "title": "Sick of Home",
      "narrative": "You notice the crack in your living room wall for the first time, though it's probably been there for years. Looking around, you see faded furniture, dusty shelves, a life you've been sleepwalking through. This place doesn't feel like home—or perhaps it never did.",
      "choices": [
        {
          "text": "It's time for a major change in your life",
          "decisionType": "soul",
          "title": "Radical Change",
          "swingMeterType": "standard",
          "meterContext": "The realization weighs on you...",
          "resultGood": "A transformative decision crystallizes. You begin dismantling the walls of your old life.",
          "resultOkay": "Small steps toward change begin taking shape, though uncertainty remains.",
          "resultFail": "The magnitude of meaningful change overwhelms you into continued inaction.",
          "effects": {
            "soul": 2,
            "connections": 1,
            "money": -2
          }
        },
        {
          "text": "Invite friends over to help redecorate",
          "decisionType": "connections",
          "title": "Community Project",
          "swingMeterType": "standard",
          "meterContext": "You consider how others might help transform your space...",
          "resultGood": "Collaboration brings new energy to your space as connections deepen through shared work.",
          "resultOkay": "A few friends help create a slight sense of renewal, though deeper issues remain.",
          "resultFail": "The superficial changes fail to address the emptiness you feel within these walls.",
          "effects": {
            "soul": 0,
            "connections": 2,
            "money": -1
          }
        },
        {
          "text": "Focus on work so you can afford a better place",
          "decisionType": "success",
          "title": "Future Investment",
          "swingMeterType": "standard",
          "meterContext": "You consider a practical approach to improvement...",
          "resultGood": "A strategic approach to improving your living situation emerges with clear steps.",
          "resultOkay": "Incremental progress toward a potential future, though current dissatisfaction lingers.",
          "resultFail": "Work becomes just another escape, not a solution to your fundamental discontent.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 2
          }
        }
      ]
    },
    {
      "stop": 13,
      "title": "Contact High",
      "narrative": "You find yourself on an unfamiliar train platform. You don't remember deciding to come here. The departures board shows destinations you've never visited. A sense of liberation washes over you—you could go anywhere, be anyone. For the first time in years, possibilities feel endless.",
      "choices": [
        {
          "text": "Board a train to somewhere new",
          "decisionType": "soul",
          "title": "Spontaneous Adventure",
          "swingMeterType": "standard",
          "meterContext": "The unfamiliar departure board presents possibilities you hadn't considered...",
          "resultGood": "A liberating moment as you step aboard, heart quickening with unexplored possibilities.",
          "resultOkay": "You take a tentative step toward something different, anxiety mixing with excitement.",
          "resultFail": "The unknown feels more terrifying than exciting. You freeze at the threshold of change.",
          "effects": {
            "soul": 2,
            "connections": -1,
            "money": -1
          }
        },
        {
          "text": "Call a friend to meet you in the city",
          "decisionType": "connections",
          "title": "Shared Experience",
          "swingMeterType": "standard",
          "meterContext": "Standing before the departures board, you think about sharing this moment...",
          "resultGood": "Spontaneous connection transforms an ordinary day into something extraordinary.",
          "resultOkay": "A pleasant meeting unfolds, though it doesn't quite match your moment of insight.",
          "resultFail": "Your attempt to connect falls flat, leaving you alone with unshared possibilities.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": -1
          }
        },
        {
          "text": "Return to your usual routine",
          "decisionType": "success",
          "title": "Practical Choice",
          "swingMeterType": "standard",
          "meterContext": "Standing before the departures board, you weigh the comfort of the familiar...",
          "resultGood": "You find unexpected comfort in returning to your routine with fresh perspective.",
          "resultOkay": "You choose the path of least resistance, relief mixing with faint disappointment.",
          "resultFail": "The routine feels like a prison of your own making, yet you cannot break free.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 0
          }
        }
      ]
    },
    {
      "stop": 14,
      "title": "The Letter",
      "narrative": "In your hands is a resignation letter. You've written and deleted it a dozen times over the years, but this version feels different. Final. Your boss would be shocked—you've always been the reliable one, the steady worker, the company drone. But something has changed inside you.",
      "choices": [
        {
          "text": "Submit the resignation letter",
          "decisionType": "soul",
          "title": "Liberation",
          "swingMeterType": "critical",
          "meterContext": "The finished letter represents years of silent compromise...",
          "resultGood": "Pure freedom as you finally act. You reclaim your life, walking taller as you leave.",
          "resultOkay": "Uncertainty mingles with potential as you take this necessary leap into the unknown.",
          "resultFail": "Doubt erodes your resolve at the last moment. Is this really the right time?",
          "effects": {
            "soul": 3,
            "connections": -1,
            "money": -3
          }
        },
        {
          "text": "Talk to colleagues about new opportunities",
          "decisionType": "connections",
          "title": "Network Change",
          "swingMeterType": "critical",
          "meterContext": "With the letter in hand, you consider your network...",
          "resultGood": "Unexpected doors open as your network becomes a source of transformation.",
          "resultOkay": "Tentative conversations hint at potential paths, though nothing concrete emerges.",
          "resultFail": "The conversations only reinforce your feeling of being trapped in your situation.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": -1
          }
        },
        {
          "text": "Save it as a draft, reconsider later",
          "decisionType": "success",
          "title": "Security First",
          "swingMeterType": "critical",
          "meterContext": "With the letter before you, you deliberate on timing...",
          "resultGood": "A strategic pause allows for careful consideration of your next professional move.",
          "resultOkay": "You maintain the status quo for now, though the desire for change remains.",
          "resultFail": "Indecision becomes its own form of imprisonment as another opportunity passes.",
          "effects": {
            "soul": -1,
            "connections": 0,
            "money": 1
          }
        }
      ]
    },
    {
      "stop": 15,
      "title": "The Feel",
      "narrative": "The train slows as it approaches your station—the same one you've arrived at thousands of times. But today, you don't automatically rise from your seat. The doors open. Other passengers file past. You remain seated, watching the familiar platform. The same platform that will be there tomorrow, unless...",
      "choices": [
        {
          "text": "Stay on the train, see where it takes you",
          "decisionType": "soul",
          "title": "New Beginning",
          "swingMeterType": "critical",
          "meterContext": "Your familiar stop passes by as you remain seated...",
          "resultGood": "A profound leap into the unknown awakens your spirit. The train carries you toward new possibilities.",
          "resultOkay": "Uncertainty and excitement mix as you continue your journey into unfamiliar territory.",
          "resultFail": "Stations pass as doubt creeps in, making you question your spontaneous decision.",
          "effects": {
            "soul": 3,
            "connections": -1,
            "money": -1
          }
        },
        {
          "text": "Get off, but call someone important to you",
          "decisionType": "connections",
          "title": "Meaningful Connection",
          "swingMeterType": "critical",
          "meterContext": "As you step onto the familiar platform...",
          "resultGood": "A transformative conversation bridges past and present with profound understanding.",
          "resultOkay": "A moment of connection, however brief, leaves you feeling slightly less alone.",
          "resultFail": "The call highlights the distances between you as words fall flat, deepening isolation.",
          "effects": {
            "soul": 1,
            "connections": 2,
            "money": 0
          }
        },
        {
          "text": "This is your stop, you have responsibilities",
          "decisionType": "success",
          "title": "Steadfast Reliability",
          "swingMeterType": "critical",
          "meterContext": "As you consider your commitments...",
          "resultGood": "Duty provides momentary comfort. You find value in consistency and commitment.",
          "resultOkay": "You choose the familiar path, finding a small measure of peace in routine.",
          "resultFail": "The routine feels suffocating, your decision weighing on you like a heavy burden.",
          "effects": {
            "soul": -1,
            "connections": 1,
            "money": 1
          }
        }
      ]
    }
  ],
  "passiveEffects": {
    "strange_passenger": {
      "id": "strange_passenger",
      "name": "Strange Passenger",
      "description": "-1 Soul each stop",
      "type": "soul-negative",
      "effect": {
        "soul": -1
      }
    },
    "last_life": {
      "id": "last_life",
      "name": "Last Life",
      "description": "-1 Soul each stop",
      "type": "soul-negative",
      "effect": {
        "soul": -1
      }
    },
    "write_along": {
      "id": "write_along", 
      "name": "Write Along The Way",
      "description": "+1 Connection each stop",
      "type": "connections-positive",
      "effect": {
        "connections": 1
      }
    }
  },
  "swingMeterTypes": {
    "standard": {
      "title": "STANDARD CHALLENGE",
      "narrative": "Balance is key. Find the right amount of effort without going too far.",
      "zones": [
        {"type": "poor", "width": 40},
        {"type": "good", "width": 20},
        {"type": "poor", "width": 40}
      ],
      "results": {
        "fail": {
          "text": "TOO WEAK",
          "modifier": -2
        },
        "good": {
          "text": "PERFECT",
          "modifier": 0
        }
      },
      "speed": 5
    },
    "critical": {
      "title": "CRITICAL MOMENT",
      "narrative": "Perfect timing required. This is your one chance - a single moment will define everything.",
      "zones": [
        {"type": "poor", "width": 80},
        {"type": "good", "width": 20}
      ],
      "results": {
        "fail": {
          "text": "FAILURE",
          "modifier": -2
        },
        "good": {
          "text": "SUCCESS",
          "modifier": 0
        }
      },
      "speed": 6
    },
    "noOvershot": {
      "title": "MEASURED RESPONSE",
      "narrative": "Finding balance is crucial. Neither too little nor too much will serve you here.",
      "zones": [
        {"type": "poor", "width": 40},
        {"type": "good", "width": 20},
        {"type": "poor", "width": 40}
      ],
      "results": {
        "fail": {
          "text": "MISSED THE MARK",
          "modifier": -2
        },
        "good": {
          "text": "BALANCED",
          "modifier": 0
        }
      },
      "speed": 5
    }
  }
}